# Preprocessing csv files

In [2]:
import pandas as pd
import numpy as np

# Bitcoin

In [15]:
bitcoin = pd.read_csv('data/bitcoin_yahoo.csv')

In [16]:
bitcoin.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,2014-09-17,465.864014,468.174011,452.421997,457.334015,457.334015,21056800
1,2014-09-18,456.859985,456.859985,413.104004,424.440002,424.440002,34483200
2,2014-09-19,424.102997,427.834991,384.532013,394.795990,394.795990,37919700
3,2014-09-20,394.673004,423.295990,389.882996,408.903992,408.903992,36863600
4,2014-09-21,408.084991,412.425995,393.181000,398.821014,398.821014,26580100

In [17]:
bit_close = bitcoin[['Date','Close']]
bit_close.rename(columns = {'Close':'bitcoin_close'}, inplace = True)

C:\Users\rajma\AppData\Local\Temp\ipykernel_11208\3422391016.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  bit_close.rename(columns = {'Close':'bitcoin_close'}, inplace = True)

In [18]:
bit_close

            Date  bitcoin_close
0     2014-09-17     457.334015
1     2014-09-18     424.440002
2     2014-09-19     394.795990
3     2014-09-20     408.903992
4     2014-09-21     398.821014
...          ...            ...
2736  2022-03-15   39338.785156
2737  2022-03-16   41143.929688
2738  2022-03-17   40951.378906
2739  2022-03-18   41801.156250
2740  2022-03-19   42190.652344

[2741 rows x 2 columns]

In [19]:
type(bit_close['Date'][0])

str

In [20]:
bit_close['Date'] = pd.to_datetime(bit_close['Date'])

C:\Users\rajma\AppData\Local\Temp\ipykernel_11208\1684096208.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  bit_close['Date'] = pd.to_datetime(bit_close['Date'])

In [21]:
bit_close.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2741 entries, 0 to 2740
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Date           2741 non-null   datetime64[ns]
 1   bitcoin_close  2741 non-null   float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 43.0 KB

In [22]:
bit_close['Date'].argmax()

2740

In [23]:
bit_close.Date.max()

Timestamp('2022-03-19 00:00:00')

In [24]:
bit_close.Date.min()

Timestamp('2014-09-17 00:00:00')

# Wheat

In [27]:
wheat = pd.read_csv('data/wheat_yahoo.csv')
wheat_close = wheat[['Date','Close']]
wheat_close.rename(columns = {'Close':'wheat_close'}, inplace = True)
wheat_close['Date'] = pd.to_datetime(wheat_close['Date'])

C:\Users\rajma\AppData\Local\Temp\ipykernel_11208\3606270237.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  wheat_close.rename(columns = {'Close':'wheat_close'}, inplace = True)
C:\Users\rajma\AppData\Local\Temp\ipykernel_11208\3606270237.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  wheat_close['Date'] = pd.to_datetime(wheat_close['Date'])

In [29]:
wheat_close.head()

        Date  wheat_close
0 2000-07-17       244.00
1 2000-07-18       241.25
2 2000-07-19       245.00
3 2000-07-20       247.00
4 2000-07-21       247.25

In [30]:
wheat_close.Date.max()

Timestamp('2022-03-18 00:00:00')

In [31]:
wheat_close.Date.min()

Timestamp('2000-07-17 00:00:00')

In [32]:
wheat_close['Date'].argmax()

5406

# heating oil

In [33]:
heat = pd.read_csv('data/heating_oil_yahoo.csv')

In [34]:
heat

            Date    Open    High     Low   Close  Adj Close  Volume
0     2000-09-01  0.9850  0.9910  0.9705  0.9764     0.9764   14679
1     2000-09-05  0.9950  0.9980  0.9750  0.9797     0.9797   17365
2     2000-09-06  0.9850  1.0000  0.9810  0.9966     0.9966   18879
3     2000-09-07  0.9900  1.0300  0.9880  1.0295     1.0295   23851
4     2000-09-08  1.0120  1.0200  0.9910  0.9949     0.9949   23189
...          ...     ...     ...     ...     ...        ...     ...
5403  2022-03-14  3.4176  3.4404  3.2145  3.2763     3.2763   27327
5404  2022-03-15  3.2286  3.2600  2.9330  3.0297     3.0297   34778
5405  2022-03-16  3.0090  3.1703  2.9740  3.1001     3.1001   28751
5406  2022-03-17  3.1627  3.5518  3.1312  3.4874     3.4874   29451
5407  2022-03-18  3.4878  3.6263  3.4365  3.5981     3.5981   26141

[5408 rows x 7 columns]

In [35]:
heat_close = heat[['Date','Close']]
heat_close.rename(columns = {'Close':'heat_close'}, inplace = True)
heat_close['Date'] = pd.to_datetime(heat_close['Date'])

C:\Users\rajma\AppData\Local\Temp\ipykernel_11208\482881054.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  heat_close.rename(columns = {'Close':'heat_close'}, inplace = True)
C:\Users\rajma\AppData\Local\Temp\ipykernel_11208\482881054.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  heat_close['Date'] = pd.to_datetime(heat_close['Date'])

In [36]:
heat_close

           Date  heat_close
0    2000-09-01      0.9764
1    2000-09-05      0.9797
2    2000-09-06      0.9966
3    2000-09-07      1.0295
4    2000-09-08      0.9949
...         ...         ...
5403 2022-03-14      3.2763
5404 2022-03-15      3.0297
5405 2022-03-16      3.1001
5406 2022-03-17      3.4874
5407 2022-03-18      3.5981

[5408 rows x 2 columns]

In [40]:
heat_close['Date'].argmax()

5407

In [41]:
heat_close.Date.min()

Timestamp('2000-09-01 00:00:00')

In [42]:
heat_close.Date.max()

Timestamp('2022-03-18 00:00:00')

## Copper

In [43]:
cop = pd.read_csv('data/copper.csv')

In [44]:
cop

            Date    Open    High     Low   Close  Adj Close  Volume
0     2000-08-30  0.8790  0.8870  0.8770  0.8850     0.8850    2886
1     2000-08-31  0.8850  0.8880  0.8800  0.8850     0.8850    1095
2     2000-09-01  0.8780  0.8890  0.8780  0.8890     0.8890    3449
3     2000-09-05  0.8960  0.9070  0.8950  0.9060     0.9060    1397
4     2000-09-06  0.9050  0.9060  0.8975  0.9015     0.9015    1195
...          ...     ...     ...     ...     ...        ...     ...
4901  2020-03-13  2.4550  2.5345  2.4300  2.4740     2.4740     803
4902  2020-03-16  2.4550  2.4600  2.3640  2.3985     2.3985     516
4903  2020-03-17  2.4170  2.4170  2.3090  2.3155     2.3155     582
4904  2020-03-18  2.3160  2.3225  2.1220  2.1605     2.1605     480
4905  2020-03-19  2.1615  2.2000  2.0595  2.2000     2.2000     470

[4906 rows x 7 columns]

In [45]:
cop_close = cop[['Date','Close']]
cop_close.rename(columns = {'Close':'copper_close'}, inplace = True)
cop_close

C:\Users\rajma\AppData\Local\Temp\ipykernel_11208\1640135574.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  cop_close.rename(columns = {'Close':'copper_close'}, inplace = True)

            Date  copper_close
0     2000-08-30        0.8850
1     2000-08-31        0.8850
2     2000-09-01        0.8890
3     2000-09-05        0.9060
4     2000-09-06        0.9015
...          ...           ...
4901  2020-03-13        2.4740
4902  2020-03-16        2.3985
4903  2020-03-17        2.3155
4904  2020-03-18        2.1605
4905  2020-03-19        2.2000

[4906 rows x 2 columns]

In [46]:
type(cop_close['Date'][0])

str

In [47]:
cop_close['Date'] = pd.to_datetime(cop_close['Date'])

C:\Users\rajma\AppData\Local\Temp\ipykernel_11208\4273253329.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  cop_close['Date'] = pd.to_datetime(cop_close['Date'])

In [48]:
cop_close.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4906 entries, 0 to 4905
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Date          4906 non-null   datetime64[ns]
 1   copper_close  4906 non-null   float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 76.8 KB

In [49]:
cop_close['Date'].argmax()

4905

In [50]:
cop_close.Date.min() #year month day

Timestamp('2000-08-30 00:00:00')

In [51]:
cop_close.Date.max()

Timestamp('2020-03-19 00:00:00')

## WTI Spot price

In [52]:
wti_close = pd.read_csv('data/WTI_oil.csv')
wti_close.rename(columns = {'Day':'Date'}, inplace = True)
wti_close.rename(columns = {wti_close.columns[1]:'WTI_dollar_per_barrel'}, inplace = True)
wti_close

            Date  WTI_dollar_per_barrel
0      06/6/2022                 118.41
1      06/3/2022                 118.97
2      06/2/2022                 116.88
3      06/1/2022                 115.26
4     05/31/2022                 114.38
...          ...                    ...
9174   01/8/1986                  25.87
9175   01/7/1986                  25.85
9176   01/6/1986                  26.53
9177   01/3/1986                  26.00
9178   01/2/1986                  25.56

[9179 rows x 2 columns]

In [53]:
wti_close.columns[1]

'WTI_dollar_per_barrel'

In [54]:
wti_close['Date'] = pd.to_datetime(wti_close['Date'])
wti_close.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9179 entries, 0 to 9178
Data columns (total 2 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Date                   9179 non-null   datetime64[ns]
 1   WTI_dollar_per_barrel  9179 non-null   float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 143.6 KB

In [55]:
wti_close.Date.min()

Timestamp('1986-01-02 00:00:00')

In [56]:
wti_close.Date.max()

Timestamp('2022-06-06 00:00:00')

In [57]:
wti_close['WTI_dollar_per_barrel'].isnull().sum()

0

In [58]:
wti_close[wti_close['WTI_dollar_per_barrel'] == np.nan]

Empty DataFrame
Columns: [Date, WTI_dollar_per_barrel]
Index: []

## DJI_index

In [59]:
dji = pd.read_csv('data/DJI_index.csv')
dji

,Date,Open,High,Low,Close,Adj Close,Volume
0,1985-01-31,1286.770020,1286.770020,1286.770020,1286.770020,1286.770020,0
1,1985-02-01,1277.719971,1277.719971,1277.719971,1277.719971,1277.719971,0
2,1985-02-04,1290.079956,1290.079956,1290.079956,1290.079956,1290.079956,0
3,1985-02-05,1285.229980,1285.229980,1285.229980,1285.229980,1285.229980,0
4,1985-02-06,1280.589966,1280.589966,1280.589966,1280.589966,1280.589966,0
...,...,...,...,...,...,...,...
8701,2020-03-13,23185.599609,23185.599609,23185.599609,23185.599609,23185.599609,0
8702,2020-03-16,20188.500000,20188.500000,20188.500000,20188.500000,20188.500000,0
8703,2020-03-17,21237.400391,21237.400391,21237.400391,21237.400391,21237.400391,0
8704,2020-03-18,19898.900391,19898.900391,19898.900391,19898.900391,19898.900391,0
8705,2020-03-19,20087.199219,20087.199219,20087.199219,20087.199219,20087.199219,0

In [60]:
dji_close = dji[['Date','Close']]
dji_close.rename(columns = {'Close':'dji_index'}, inplace = True)
dji_close

C:\Users\rajma\AppData\Local\Temp\ipykernel_11208\4215868839.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dji_close.rename(columns = {'Close':'dji_index'}, inplace = True)

            Date     dji_index
0     1985-01-31   1286.770020
1     1985-02-01   1277.719971
2     1985-02-04   1290.079956
3     1985-02-05   1285.229980
4     1985-02-06   1280.589966
...          ...           ...
8701  2020-03-13  23185.599609
8702  2020-03-16  20188.500000
8703  2020-03-17  21237.400391
8704  2020-03-18  19898.900391
8705  2020-03-19  20087.199219

[8706 rows x 2 columns]

In [61]:
dji_close['Date'] = pd.to_datetime(dji_close['Date'])

C:\Users\rajma\AppData\Local\Temp\ipykernel_11208\103630868.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dji_close['Date'] = pd.to_datetime(dji_close['Date'])

In [62]:
dji_close.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8706 entries, 0 to 8705
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       8706 non-null   datetime64[ns]
 1   dji_index  8706 non-null   float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 136.2 KB

In [63]:
dji_close.Date.max()

Timestamp('2020-03-19 00:00:00')

In [64]:
dji_close.Date.min()

Timestamp('1985-01-31 00:00:00')

In [65]:
dji_close['dji_index'].isnull().sum()

0

## FEDFUNDS.csv

In [66]:
fed = pd.read_csv('data/FEDFUNDS.csv')
fed.rename(columns = {'DATE':'Date'}, inplace = True)
fed

           Date  FEDFUNDS
0    1954-07-01      0.80
1    1954-08-01      1.22
2    1954-09-01      1.07
3    1954-10-01      0.85
4    1954-11-01      0.83
..          ...       ...
810  2022-01-01      0.08
811  2022-02-01      0.08
812  2022-03-01      0.20
813  2022-04-01      0.33
814  2022-05-01      0.77

[815 rows x 2 columns]

In [67]:
fed['Date'] = pd.to_datetime(fed['Date'])

In [68]:
fed.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 815 entries, 0 to 814
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      815 non-null    datetime64[ns]
 1   FEDFUNDS  815 non-null    float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 12.9 KB

In [69]:
fed.Date.min()

Timestamp('1954-07-01 00:00:00')

In [70]:
fed.Date.max()

Timestamp('2022-05-01 00:00:00')

In [71]:
fed['FEDFUNDS'].isnull().sum()

0

## gold.csv

In [72]:
gol = pd.read_csv('data/gold.csv')
gol

,Date,Open,High,Low,Close,Adj Close,Volume
0,2000-08-30,273.899994,273.899994,273.899994,273.899994,273.899994,0
1,2000-08-31,274.799988,278.299988,274.799988,278.299988,278.299988,0
2,2000-09-01,277.000000,277.000000,277.000000,277.000000,277.000000,0
3,2000-09-05,275.799988,275.799988,275.799988,275.799988,275.799988,2
4,2000-09-06,274.200012,274.200012,274.200012,274.200012,274.200012,0
...,...,...,...,...,...,...,...
4897,2020-03-13,1574.900024,1589.800049,1513.800049,1515.699951,1515.699951,89
4898,2020-03-16,1569.099976,1569.099976,1452.099976,1485.900024,1485.900024,193
4899,2020-03-17,1469.300049,1537.699951,1469.300049,1524.900024,1524.900024,122
4900,2020-03-18,1537.500000,1542.000000,1477.300049,1477.300049,1477.300049,333
4901,2020-03-19,1481.500000,1491.599976,1471.000000,1478.599976,1478.599976,262

In [73]:
gold_close = gol[['Date','Close']]
gold_close.rename(columns = {'Close':'gold_close'}, inplace = True)
gold_close

C:\Users\rajma\AppData\Local\Temp\ipykernel_11208\3826366341.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  gold_close.rename(columns = {'Close':'gold_close'}, inplace = True)

            Date   gold_close
0     2000-08-30   273.899994
1     2000-08-31   278.299988
2     2000-09-01   277.000000
3     2000-09-05   275.799988
4     2000-09-06   274.200012
...          ...          ...
4897  2020-03-13  1515.699951
4898  2020-03-16  1485.900024
4899  2020-03-17  1524.900024
4900  2020-03-18  1477.300049
4901  2020-03-19  1478.599976

[4902 rows x 2 columns]

In [74]:
gold_close['Date'] = pd.to_datetime(gold_close['Date'])

C:\Users\rajma\AppData\Local\Temp\ipykernel_11208\2608039323.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  gold_close['Date'] = pd.to_datetime(gold_close['Date'])

In [75]:
gold_close.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4902 entries, 0 to 4901
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Date        4902 non-null   datetime64[ns]
 1   gold_close  4902 non-null   float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 76.7 KB

In [76]:
gold_close.Date.min()

Timestamp('2000-08-30 00:00:00')

In [77]:
gold_close.Date.max()

Timestamp('2020-03-19 00:00:00')

In [78]:
gold_close['gold_close'].isnull().sum()

0

## Henry_Hub_Natural_Gas_Spot_Price.csv

In [79]:
hen = pd.read_csv('data/Henry_Hub_Natural_Gas_Spot_Price.csv')
hen.rename(columns = {'Day':'Date'}, inplace = True)
hen

            Date  Henry Hub Natural Gas Spot Price Dollars per Million Btu
0      06/7/2022                                               9.28
1      06/6/2022                                               9.08
2      06/3/2022                                               8.34
3      06/2/2022                                               8.90
4      06/1/2022                                               8.47
...          ...                                                ...
6384  01/13/1997                                               4.00
6385  01/10/1997                                               3.92
6386   01/9/1997                                               3.61
6387   01/8/1997                                               3.80
6388   01/7/1997                                               3.82

[6389 rows x 2 columns]

In [80]:
hen['Date'] = pd.to_datetime(hen['Date'])

In [81]:
hen.Date.min()

Timestamp('1997-01-07 00:00:00')

In [82]:
hen.Date.max()

Timestamp('2022-06-07 00:00:00')

In [83]:
hen['Henry Hub Natural Gas Spot Price Dollars per Million Btu'].isnull()

0       False
1       False
2       False
3       False
4       False
        ...
6384    False
6385    False
6386    False
6387    False
6388    False
Name: Henry Hub Natural Gas Spot Price Dollars per Million Btu, Length: 6389, dtype: bool

In [84]:
hen[hen['Henry Hub Natural Gas Spot Price Dollars per Million Btu'].isnull() == True]

           Date  Henry Hub Natural Gas Spot Price Dollars per Million Btu
1104 2018-01-05                                                NaN

In [85]:
hen.at[1104,'Henry Hub Natural Gas Spot Price Dollars per Million Btu']=hen.iloc[1105]['Henry Hub Natural Gas Spot Price Dollars per Million Btu']

In [86]:
hen[hen['Henry Hub Natural Gas Spot Price Dollars per Million Btu'].isnull() == True]

Empty DataFrame
Columns: [Date, Henry Hub Natural Gas Spot Price Dollars per Million Btu]
Index: []

## nasdaq_index.csv

In [87]:
nas = pd.read_csv('data/nasdaq_index.csv')
nas

,Date,Open,High,Low,Close,Adj Close,Volume
0,1985-01-31,278.200012,278.899994,278.200012,278.700012,278.700012,92290000
1,1985-02-01,277.899994,278.500000,277.899994,278.399994,278.399994,85330000
2,1985-02-04,278.799988,280.799988,278.799988,280.799988,280.799988,88440000
3,1985-02-05,281.799988,282.700012,281.799988,282.600006,282.600006,98950000
4,1985-02-06,283.799988,284.700012,283.799988,284.500000,284.500000,102300000
...,...,...,...,...,...,...,...
8850,2020-03-13,7610.390137,7875.930176,7219.089844,7874.879883,7874.879883,4685890000
8851,2020-03-16,7392.729980,7422.200195,6882.859863,6904.589844,6904.589844,4594360000
8852,2020-03-17,7072.000000,7406.229980,6828.910156,7334.779785,7334.779785,4900000000
8853,2020-03-18,6902.319824,7182.830078,6686.359863,6989.839844,6989.839844,4890820000
8854,2020-03-19,6996.450195,7341.379883,6858.379883,7150.580078,7150.580078,4762170000

In [88]:
nas_close = nas[['Date','Close']]
nas_close.rename(columns = {'Close':'nasdaq_close'}, inplace = True)
nas_close

C:\Users\rajma\AppData\Local\Temp\ipykernel_11208\1152762958.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  nas_close.rename(columns = {'Close':'nasdaq_close'}, inplace = True)

            Date  nasdaq_close
0     1985-01-31    278.700012
1     1985-02-01    278.399994
2     1985-02-04    280.799988
3     1985-02-05    282.600006
4     1985-02-06    284.500000
...          ...           ...
8850  2020-03-13   7874.879883
8851  2020-03-16   6904.589844
8852  2020-03-17   7334.779785
8853  2020-03-18   6989.839844
8854  2020-03-19   7150.580078

[8855 rows x 2 columns]

In [89]:
nas_close['Date'] = pd.to_datetime(nas_close['Date'])

C:\Users\rajma\AppData\Local\Temp\ipykernel_11208\3223871914.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  nas_close['Date'] = pd.to_datetime(nas_close['Date'])

In [90]:
nas_close.Date.min()

Timestamp('1985-01-31 00:00:00')

In [91]:
nas_close.Date.max()

Timestamp('2020-03-19 00:00:00')

In [92]:
nas_close[nas_close['nasdaq_close'].isnull() == True]

Empty DataFrame
Columns: [Date, nasdaq_close]
Index: []

## S&P500_data.csv

In [93]:
sp = pd.read_csv('data/SP500_yahoo.csv')
sp

,Date,Open,High,Low,Close,Adj Close,Volume
0,1985-01-31,179.389999,179.830002,178.559998,179.630005,179.630005,132500000
1,1985-02-01,179.630005,179.630005,178.440002,178.630005,178.630005,105400000
2,1985-02-04,178.630005,180.350006,177.750000,180.350006,180.350006,113700000
3,1985-02-05,180.350006,181.529999,180.070007,180.610001,180.610001,143900000
4,1985-02-06,180.610001,181.500000,180.320007,180.429993,180.429993,141000000
...,...,...,...,...,...,...,...
9102,2021-03-15,3942.959961,3970.080078,3923.540039,3968.939941,3968.939941,4882190000
9103,2021-03-16,3973.590088,3981.040039,3953.439941,3962.709961,3962.709961,4604870000
9104,2021-03-17,3949.570068,3983.870117,3935.739990,3974.120117,3974.120117,4541620000
9105,2021-03-18,3953.500000,3969.620117,3910.860107,3915.459961,3915.459961,4043170000
9106,2021-03-19,3913.139893,3930.120117,3886.750000,3913.100098,3913.100098,7725050000

In [94]:
sp_close = sp[['Date','Close']]
sp_close.rename(columns = {'Close':'SP500'}, inplace = True)
sp_close

C:\Users\rajma\AppData\Local\Temp\ipykernel_11208\737618160.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sp_close.rename(columns = {'Close':'SP500'}, inplace = True)

            Date        SP500
0     1985-01-31   179.630005
1     1985-02-01   178.630005
2     1985-02-04   180.350006
3     1985-02-05   180.610001
4     1985-02-06   180.429993
...          ...          ...
9102  2021-03-15  3968.939941
9103  2021-03-16  3962.709961
9104  2021-03-17  3974.120117
9105  2021-03-18  3915.459961
9106  2021-03-19  3913.100098

[9107 rows x 2 columns]

In [95]:
sp_close['Date'] = pd.to_datetime(sp_close['Date'])

C:\Users\rajma\AppData\Local\Temp\ipykernel_11208\1797486908.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sp_close['Date'] = pd.to_datetime(sp_close['Date'])

In [96]:
sp_close.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9107 entries, 0 to 9106
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    9107 non-null   datetime64[ns]
 1   SP500   9107 non-null   float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 142.4 KB

In [97]:
sp_close.Date.min()

Timestamp('1985-01-31 00:00:00')

In [98]:
sp_close.Date.max()

Timestamp('2021-03-19 00:00:00')

In [99]:
sp_close[sp_close['SP500'].isnull() == True]

Empty DataFrame
Columns: [Date, SP500]
Index: []

## silver.csv

In [100]:
sil = pd.read_csv('data/silver.csv')
sil

            Date    Open    High     Low   Close  Adj Close  Volume
0     2000-08-30   4.950   4.950   4.895   4.930      4.930    2319
1     2000-08-31   4.920   5.045   4.920   5.003      5.003    1612
2     2000-09-01   5.035   5.035   4.985   5.004      5.004    1375
3     2000-09-05   4.990   5.005   4.975   4.998      4.998     856
4     2000-09-06   5.000   5.000   4.980   4.983      4.983     232
...          ...     ...     ...     ...     ...        ...     ...
4899  2020-03-13  15.755  15.765  14.425  14.456     14.456     506
4900  2020-03-16  14.885  14.885  11.850  12.772     12.772     104
4901  2020-03-17  12.550  12.710  12.415  12.469     12.469     194
4902  2020-03-18  12.560  12.825  11.735  11.735     11.735     184
4903  2020-03-19  12.070  12.205  11.895  12.097     12.097      45

[4904 rows x 7 columns]

In [101]:
sil_close = sil[['Date','Close']]
sil_close.rename(columns = {'Close':'silver_close'}, inplace = True)
sil_close

C:\Users\rajma\AppData\Local\Temp\ipykernel_11208\3297253989.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sil_close.rename(columns = {'Close':'silver_close'}, inplace = True)

            Date  silver_close
0     2000-08-30         4.930
1     2000-08-31         5.003
2     2000-09-01         5.004
3     2000-09-05         4.998
4     2000-09-06         4.983
...          ...           ...
4899  2020-03-13        14.456
4900  2020-03-16        12.772
4901  2020-03-17        12.469
4902  2020-03-18        11.735
4903  2020-03-19        12.097

[4904 rows x 2 columns]

In [102]:
sil_close['Date'] = pd.to_datetime(sil_close['Date'])

C:\Users\rajma\AppData\Local\Temp\ipykernel_11208\1371323969.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sil_close['Date'] = pd.to_datetime(sil_close['Date'])

In [103]:
sil_close.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4904 entries, 0 to 4903
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Date          4904 non-null   datetime64[ns]
 1   silver_close  4904 non-null   float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 76.8 KB

In [104]:
sil_close.Date.min()

Timestamp('2000-08-30 00:00:00')

In [105]:
sil_close.Date.max()

Timestamp('2020-03-19 00:00:00')

In [106]:
sil_close[sil_close['silver_close'].isnull() == True]

Empty DataFrame
Columns: [Date, silver_close]
Index: []

## Euro

In [107]:
eur = pd.read_csv('data/USD_EURO.csv')
eur

            Date     Open     High       Low    Close  Adj Close  Volume
0     2003-12-01  0.83098  0.83724  0.830560  0.83577    0.83577       0
1     2003-12-02  0.83605  0.83710  0.825830  0.82720    0.82720       0
2     2003-12-03  0.82713  0.82802  0.824400  0.82488    0.82488       0
3     2003-12-04  0.82508  0.83029  0.823450  0.82775    0.82775       0
4     2003-12-05  0.82795  0.82878  0.820280  0.82055    0.82055       0
...          ...      ...      ...       ...      ...        ...     ...
4220  2020-03-13  0.89417  0.90372  0.891160  0.89406    0.89406       0
4221  2020-03-16  0.89609  0.90182  0.890044  0.89643    0.89643       0
4222  2020-03-17  0.89579  0.91258  0.893730  0.89580    0.89580       0
4223  2020-03-18  0.90770  0.92320  0.905387  0.90781    0.90781       0
4224  2020-03-19  0.91379  0.93476  0.913610  0.91228    0.91228       0

[4225 rows x 7 columns]

In [108]:
eur_close = eur[['Date','Close']] 
eur_close.rename(columns = {'Close':'eur_close'}, inplace = True)
eur_close

C:\Users\rajma\AppData\Local\Temp\ipykernel_11208\1053380841.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  eur_close.rename(columns = {'Close':'eur_close'}, inplace = True)

            Date  eur_close
0     2003-12-01    0.83577
1     2003-12-02    0.82720
2     2003-12-03    0.82488
3     2003-12-04    0.82775
4     2003-12-05    0.82055
...          ...        ...
4220  2020-03-13    0.89406
4221  2020-03-16    0.89643
4222  2020-03-17    0.89580
4223  2020-03-18    0.90781
4224  2020-03-19    0.91228

[4225 rows x 2 columns]

In [109]:
eur_close['Date'] = pd.to_datetime(eur_close['Date'])

C:\Users\rajma\AppData\Local\Temp\ipykernel_11208\3958437590.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  eur_close['Date'] = pd.to_datetime(eur_close['Date'])

In [110]:
eur_close.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4225 entries, 0 to 4224
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       4225 non-null   datetime64[ns]
 1   eur_close  4225 non-null   float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 66.1 KB

In [111]:
eur_close.Date.min()

Timestamp('2003-12-01 00:00:00')

In [112]:
eur_close.Date.max()

Timestamp('2020-03-19 00:00:00')

In [113]:
eur_close[eur_close['eur_close'].isnull() == True]

Empty DataFrame
Columns: [Date, eur_close]
Index: []

## RUB

In [114]:
rub = pd.read_csv('data/USD_RUB.csv')
rub

,Date,Open,High,Low,Close,Adj Close,Volume
0,2003-12-01,29.730000,29.730000,29.690001,29.700001,29.700001,0
1,2003-12-02,29.690001,29.700001,29.690001,29.690001,29.690001,0
2,2003-12-03,29.690001,29.690001,29.690001,29.690001,29.690001,0
3,2003-12-04,29.680000,29.680000,29.680000,29.680000,29.680000,0
4,2003-12-05,29.629999,29.629999,29.629999,29.620001,29.620001,0
...,...,...,...,...,...,...,...
4111,2020-03-13,74.879700,74.882599,72.053001,74.898102,74.898102,0
4112,2020-03-16,73.204697,75.389000,72.833099,73.237999,73.237999,0
4113,2020-03-17,74.356300,75.205002,73.446999,74.356300,74.356300,0
4114,2020-03-18,75.147903,80.231003,75.102097,75.297501,75.297501,0
4115,2020-03-19,80.921303,82.073799,79.242996,80.919998,80.919998,0

In [115]:
rub_close = rub[['Date','Close']]
rub_close.rename(columns = {'Close':'rub_close'}, inplace = True)
rub_close

C:\Users\rajma\AppData\Local\Temp\ipykernel_11208\27337608.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  rub_close.rename(columns = {'Close':'rub_close'}, inplace = True)

            Date  rub_close
0     2003-12-01  29.700001
1     2003-12-02  29.690001
2     2003-12-03  29.690001
3     2003-12-04  29.680000
4     2003-12-05  29.620001
...          ...        ...
4111  2020-03-13  74.898102
4112  2020-03-16  73.237999
4113  2020-03-17  74.356300
4114  2020-03-18  75.297501
4115  2020-03-19  80.919998

[4116 rows x 2 columns]

In [116]:
rub_close['Date'] = pd.to_datetime(rub_close['Date'])

C:\Users\rajma\AppData\Local\Temp\ipykernel_11208\2770490134.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  rub_close['Date'] = pd.to_datetime(rub_close['Date'])

In [117]:
rub_close.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4116 entries, 0 to 4115
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       4116 non-null   datetime64[ns]
 1   rub_close  4116 non-null   float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 64.4 KB

In [118]:
rub_close.Date.min()

Timestamp('2003-12-01 00:00:00')

In [119]:
rub_close.Date.max()

Timestamp('2020-03-19 00:00:00')

In [120]:
rub_close[rub_close['rub_close'].isnull() == True]

Empty DataFrame
Columns: [Date, rub_close]
Index: []

## brent_oil_future.csv

In [121]:
brent = pd.read_csv('data/brent_oil_future.csv')
brent

,Date,Open,High,Low,Close,Adj Close,Volume
0,2007-07-30,75.849998,76.529999,75.440002,75.739998,75.739998,2575
1,2007-07-31,75.699997,77.169998,75.669998,77.050003,77.050003,3513
2,2007-08-01,77.000000,77.059998,74.860001,75.349998,75.349998,3930
3,2007-08-02,75.220001,76.209999,74.269997,75.760002,75.760002,6180
4,2007-08-03,75.389999,76.000000,74.529999,74.750000,74.750000,4387
...,...,...,...,...,...,...,...
3121,2020-03-13,32.860001,35.990002,32.169998,33.849998,33.849998,50707
3122,2020-03-16,34.459999,34.549999,29.340000,30.049999,30.049999,43527
3123,2020-03-17,29.700001,31.219999,28.459999,28.730000,28.730000,32969
3124,2020-03-18,28.660000,29.190001,24.510000,24.879999,24.879999,47500
3125,2020-03-19,26.440001,29.379999,24.980000,28.469999,28.469999,41724

In [122]:
brent_close = brent[['Date','Close']]
brent_close.rename(columns = {'Close':'brent_oil_future'}, inplace = True)
brent_close

C:\Users\rajma\AppData\Local\Temp\ipykernel_11208\2296026202.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  brent_close.rename(columns = {'Close':'brent_oil_future'}, inplace = True)

            Date  brent_oil_future
0     2007-07-30         75.739998
1     2007-07-31         77.050003
2     2007-08-01         75.349998
3     2007-08-02         75.760002
4     2007-08-03         74.750000
...          ...               ...
3121  2020-03-13         33.849998
3122  2020-03-16         30.049999
3123  2020-03-17         28.730000
3124  2020-03-18         24.879999
3125  2020-03-19         28.469999

[3126 rows x 2 columns]

In [123]:
brent_close['Date'] = pd.to_datetime(brent_close['Date'])

C:\Users\rajma\AppData\Local\Temp\ipykernel_11208\154349038.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  brent_close['Date'] = pd.to_datetime(brent_close['Date'])

In [124]:
brent_close.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3126 entries, 0 to 3125
Data columns (total 2 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Date              3126 non-null   datetime64[ns]
 1   brent_oil_future  3126 non-null   float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 49.0 KB

In [125]:
brent_close.Date.min()

Timestamp('2007-07-30 00:00:00')

In [126]:
brent_close.Date.max()

Timestamp('2020-03-19 00:00:00')

In [129]:
brent_close[brent_close['brent_oil_future'].isnull() == True]

Empty DataFrame
Columns: [Date, brent_oil_future]
Index: []

In [130]:
brent_close

           Date  brent_oil_future
0    2007-07-30         75.739998
1    2007-07-31         77.050003
2    2007-08-01         75.349998
3    2007-08-02         75.760002
4    2007-08-03         74.750000
...         ...               ...
3121 2020-03-13         33.849998
3122 2020-03-16         30.049999
3123 2020-03-17         28.730000
3124 2020-03-18         24.879999
3125 2020-03-19         28.469999

[3126 rows x 2 columns]

In [128]:
# wti_close.rename(columns = {'Day':'Date'}, inplace = True)

# cop_close = cop[['Date','Close']]
# cop_close

# cop_close['Date'] = pd.to_datetime(cop_close['Date'])

# dji_close.Date.min()

# Merging all dataframes

In [140]:
df_list = [wti_close,cop_close,dji_close, fed, gold_close, hen, nas_close, sp_close, sil_close, eur_close,rub_close]

### Merging only those dataframes that have daily values, so removing FEDFUNDS

In [153]:

from functools import reduce
df2_merge = reduce(lambda  left,right: pd.merge(left,right,on=['Date'],
                                            how='outer'), [wti_close,cop_close,dji_close, gold_close,eur_close,hen,rub_close,sil_close,nas_close,sp_close, heat_close, wheat_close])
df2_merge = df2_merge.dropna()
df2_merge = df2_merge.set_index('Date')
df2_merge
# df2_merge.to_csv('oil_top_10.csv')

,WTI_dollar_per_barrel,copper_close,dji_index,gold_close,eur_close,Henry Hub Natural Gas Spot Price Dollars per Million Btu,rub_close,silver_close,nasdaq_close,SP500,heat_close,wheat_close
Date,,,,,,,,,,,,
2020-03-19,25.09,2.2000,20087.199219,1478.599976,0.91228,1.68,80.919998,12.097,7150.580078,2409.389893,1.0417,535.00
2020-03-18,20.48,2.1605,19898.900391,1477.300049,0.90781,1.73,75.297501,11.735,6989.839844,2398.100098,0.9542,508.25
2020-03-17,26.96,2.3155,21237.400391,1524.900024,0.89580,1.89,74.356300,12.469,7334.779785,2529.189941,1.0357,499.25
2020-03-16,28.96,2.3985,20188.500000,1485.900024,0.89643,1.89,73.237999,12.772,6904.589844,2386.129883,1.0466,498.00
2020-03-13,31.72,2.4740,23185.599609,1515.699951,0.89406,1.94,74.898102,14.456,7874.879883,2711.020020,1.1374,514.75
...,...,...,...,...,...,...,...,...,...,...,...,...
2004-01-07,33.57,1.0625,10529.000000,421.899994,0.79108,6.61,29.240000,6.251,2077.679932,1126.329956,0.9661,395.50
2004-01-06,33.54,1.0670,10538.700195,422.799988,0.78610,7.04,29.250000,6.316,2057.370117,1123.670044,0.9774,394.50
2004-01-05,33.71,1.0830,10544.099609,424.399994,0.78821,6.28,29.230000,6.233,2047.359985,1122.219971,0.9684,398.50
2003-12-31,32.51,1.0430,10453.900391,415.700012,0.79428,5.76,29.230000,5.953,2003.369995,1111.920044,0.9127,377.00
2003-12-30,33.01,1.0400,10425.000000,416.899994,0.79688,5.96,29.240000,5.983,2009.880005,1109.640015,0.9294,396.25

In [154]:
df2_merge.index.min()

Timestamp('2003-12-30 00:00:00')

In [155]:
df2_merge.index.max()

Timestamp('2020-03-19 00:00:00')

In [156]:
df2_merge

,WTI_dollar_per_barrel,copper_close,dji_index,gold_close,eur_close,Henry Hub Natural Gas Spot Price Dollars per Million Btu,rub_close,silver_close,nasdaq_close,SP500,heat_close,wheat_close
Date,,,,,,,,,,,,
2020-03-19,25.09,2.2000,20087.199219,1478.599976,0.91228,1.68,80.919998,12.097,7150.580078,2409.389893,1.0417,535.00
2020-03-18,20.48,2.1605,19898.900391,1477.300049,0.90781,1.73,75.297501,11.735,6989.839844,2398.100098,0.9542,508.25
2020-03-17,26.96,2.3155,21237.400391,1524.900024,0.89580,1.89,74.356300,12.469,7334.779785,2529.189941,1.0357,499.25
2020-03-16,28.96,2.3985,20188.500000,1485.900024,0.89643,1.89,73.237999,12.772,6904.589844,2386.129883,1.0466,498.00
2020-03-13,31.72,2.4740,23185.599609,1515.699951,0.89406,1.94,74.898102,14.456,7874.879883,2711.020020,1.1374,514.75
...,...,...,...,...,...,...,...,...,...,...,...,...
2004-01-07,33.57,1.0625,10529.000000,421.899994,0.79108,6.61,29.240000,6.251,2077.679932,1126.329956,0.9661,395.50
2004-01-06,33.54,1.0670,10538.700195,422.799988,0.78610,7.04,29.250000,6.316,2057.370117,1123.670044,0.9774,394.50
2004-01-05,33.71,1.0830,10544.099609,424.399994,0.78821,6.28,29.230000,6.233,2047.359985,1122.219971,0.9684,398.50
2003-12-31,32.51,1.0430,10453.900391,415.700012,0.79428,5.76,29.230000,5.953,2003.369995,1111.920044,0.9127,377.00
2003-12-30,33.01,1.0400,10425.000000,416.899994,0.79688,5.96,29.240000,5.983,2009.880005,1109.640015,0.9294,396.25